mbuckaway/esp32-homekit-temp/main/app_main.c
/*
 * MIT License
 * 
 * HomeKit temp Project with BME 680 support
 */

#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include "freertos/queue.h"
#include <esp_event.h>
#include <esp_log.h>
#include <math.h>

#include <hap.h>
#include <hap_apple_servs.h>
#include <hap_apple_chars.h>

#include <iot_button.h>

#include <app_wifi.h>
#include <app_hap_setup_payload.h>


#include "esp_adc/adc_oneshot.h"
#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"

#include <dht.h>

//libraries for BME68x support
#include "driver/i2c.h"
#include "bsec_integration.h"
#include <nvs_flash.h>
#include <nvs.h>
#include "bsec_iaq.h"
#include "esp_timer.h"

// Library for HD44780 Screen Support
#include <hd44780.h>
#include <sys/time.h>

#define I2C_MASTER_TX_BUF_DISABLE 0 /*!< I2C master doesn't need buffer */
#define I2C_MASTER_RX_BUF_DISABLE 0 /*!< I2C master doesn't need buffer */
#define I2C_FREQUENCY   100000
#define I2C_GPIO_SDA    GPIO_NUM_21
#define I2C_GPIO_SCL    GPIO_NUM_22
#define ACTIVE_I2C      I2C_NUM_1

#define SENSOR_IN_USE   1 /*!< set to 1 for BME68X and 2 for DHT */
#define LCD1602_IN_USE 1 /* Set to 1 if LCD1602A screen is present and 0 if not*/

static const char* sensor_binary = "sensor_blob";


static const dht_sensor_type_t sensor_type = DHT_TYPE_AM2301;

static bool example_adc_calibration_init(adc_unit_t unit, adc_atten_t atten, adc_cali_handle_t *out_handle);
static void example_adc_calibration_deinit(adc_cali_handle_t handle);

    static adc_oneshot_unit_handle_t adc1_handle;
static adc_cali_handle_t adc1_cali_handle = NULL;
static bool do_calibration1;

#if CONFIG_IDF_TARGET_ESP32
static const adc_bitwidth_t width = ADC_BITWIDTH_12;
#elif CONFIG_IDF_TARGET_ESP32S2
// 13bit ADC will cause issues with battery voltage formula
static const adc_bitwidth_t width = ADC_BITWIDTH_12;
#endif
static const adc_atten_t atten = ADC_ATTEN_DB_11;


static int adc_raw;
static int voltage;

/*  Required for server verification during OTA, PEM format as string  */
char server_cert[] = {};

static const char *TAG = "HAP";

static const uint16_t temp_TASK_PRIORITY = 1;
static const uint16_t temp_TASK_STACKSIZE = 4 * 1024;
static const char *temp_TASK_NAME = "hap_garage";

/* Reset network credentials if button is pressed for more than 3 seconds and then released */
static const uint16_t RESET_NETWORK_BUTTON_TIMEOUT = 3;

/* Reset to factory if button is pressed and held for more than 10 seconds */
 static const uint16_t RESET_TO_FACTORY_BUTTON_TIMEOUT = 10;

/* The button "Boot" will be used as the Reset button for the example */
static const uint16_t RESET_GPIO = GPIO_NUM_0;

// Stack size of the bSEC processing loop
static const uint16_t BSEC_STACK_SIZE = 10 * 1024;


/*!
 * @brief           Write operation in either Wire or SPI
 *
 * param[in]        reg_addr        register address
 * param[in]        reg_data_ptr    pointer to the data to be written
 * param[in]        data_len        number of bytes to be written
 * param[in]        intf_ptr        interface pointer
 *
 * @return          result of the bus communication function
 */
int8_t bus_write(uint8_t reg_addr, const uint8_t *reg_data_ptr, uint32_t data_len, void *intf_ptr)
{
    // ...
    // Please insert system specific function to write to the bus where BME68x is connected
    // ...
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();
    assert(data_len > 0 && reg_data_ptr != NULL); // Safeguarding the assumptions
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, (0x76 << 1) | I2C_MASTER_WRITE, true);
    i2c_master_write_byte(cmd, reg_addr, true);
    i2c_master_write(cmd, reg_data_ptr, data_len, true);
    i2c_master_stop(cmd);
    esp_err_t ret = i2c_master_cmd_begin(ACTIVE_I2C, cmd, pdMS_TO_TICKS(1000));
    i2c_cmd_link_delete(cmd);
    // ESP_OK matches with the function success code (0)
    return (int8_t)ret;
    return 0;
}
/*!
 * @brief           Read operation in either Wire or SPI
 *
 * param[in]        reg_addr        register address
 * param[out]       reg_data_ptr    pointer to the memory to be used to store the read data
 * param[in]        data_len        number of bytes to be read
 * param[in]        intf_ptr        interface pointer
 * 
 * @return          result of the bus communication function
 */
int8_t bus_read(uint8_t reg_addr, uint8_t *reg_data_ptr, uint32_t data_len, void *intf_ptr)
{
    // ...
    // Please insert system specific function to read from bus where BME68x is connected
    // ...
    // ...
    // Please insert system specific function to read from bus where BME680 is connected
    // ...
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();

    assert(data_len > 0 && reg_data_ptr != NULL); // Safeguarding the assumptions
    // Feeding the command in
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, (0x76 << 1) | I2C_MASTER_WRITE, true);
    i2c_master_write_byte(cmd, reg_addr, true);

    //bme680_sleep(150);
    // Reading data back
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, (0x76 << 1) | I2C_MASTER_READ, true);
    if (data_len > 1) {
        i2c_master_read(cmd, reg_data_ptr, data_len - 1, I2C_MASTER_ACK);
    }
    i2c_master_read_byte(cmd, reg_data_ptr + data_len - 1, I2C_MASTER_NACK);
    i2c_master_stop(cmd);
    esp_err_t ret = i2c_master_cmd_begin(ACTIVE_I2C, cmd, pdMS_TO_TICKS(1000));
    i2c_cmd_link_delete(cmd);
    // ESP_OK matches with the function success code (0)
    return (int8_t)ret;
    //return 0;
}





/*!
 * @brief           System specific implementation of sleep function
 *
 * @param[in]       t_us     Time in microseconds
 * @param[in]       intf_ptr Pointer to the interface descriptor
 * 
 * @return          none
 */
static void bme680_sleep(uint32_t t_us, void *intf_ptr)
{
    // ...
    // Please insert system specific function sleep or delay for t_ms milliseconds
    // ...
    vTaskDelay(pdMS_TO_TICKS(t_us/10));
}
/*!
 * @brief           Handling of the ready outputs
 *
 * @param[in]       timestamp               time in nanoseconds
 * @param[in]       iaq                     Indoor-air-quality estimate [0-500]
 * @param[in]       iaq_accuracy            Indoor-air-quality accuracy
 * @param[in]       siaq                    Unscaled indoor-air-quality estimate
 * @param[in]       siaq_accuracy           Unscaled indoor-air-quality accuracy
 * @param[in]       compensateTemperature   Sensor heat compensated temperature [degrees Celsius]
 * @param[in]       compensateHumidity      Sensor heat compensated humidity [%]
 * @param[in]       raw_pressure            Pressure sensor signal [Pa]
 * @param[in]       raw_temp                Temperature sensor signal [degrees Celsius]
 * @param[in]       raw_humidity            Relative humidity sensor signal [%]
 * @param[in]       raw_gas                 Gas sensor signal [Ohm]
 * @param[in]       co2                     CO2 equivalent estimate [ppm]
 * @param[in]       bsec_status             value returned by the bsec_do_steps() call
 *
 * @return          none
 */
static float BME68xtemperature = 0.0;
static float BME68xhumidity = 0.0;
static float BME68xsIAQ = 0.0;
static float BME68xC02 = 0.0;
static float BME68xbVOC = 0.0;


static hd44780_t lcd = {
    .write_cb = NULL,
    .font = HD44780_FONT_5X8,
    .lines = 2,
    .pins = {
        .rs = GPIO_NUM_19,
        .e  = GPIO_NUM_23,
        .d4 = GPIO_NUM_18,
        .d5 = GPIO_NUM_17,
        .d6 = GPIO_NUM_16,
        .d7 = GPIO_NUM_15,
        .bl = HD44780_NOT_USED
    }
};


void output_ready(int64_t timestamp, float iaq, uint8_t iaq_accuracy, float siaq, uint8_t siaq_accuracy, float compensateTemperature, float compensateHumidity,
     float raw_pressure, float raw_temp, float raw_humidity, float raw_gas, float co2, float bVOC, bsec_library_return_t bsec_status) {
    // ...
    // Please insert system specific code to further process or display the BSEC outputs
    // ...

    BME68xtemperature = compensateTemperature;
    BME68xhumidity = compensateHumidity;
    BME68xsIAQ = siaq;
    BME68xC02 = co2;
    BME68xbVOC = bVOC;
    
    ESP_LOGI("BME 680", "[timestamp: %"PRId64"] [IAQ reading: %f] [IAQ Accuracy: %d] [SIAQ reading: %f] [sIAQ Accuracy: %d] [Compensated Temperature: %f] [Compensated Humidity: %f] [raw_pressure: %f] [raw_temp: %f] [raw_humidity: %f] [raw_gas: %f] [co2_equivalent: %f] [bVOC: %f] [bsec_status: %d]\n", timestamp, iaq, iaq_accuracy, siaq, siaq_accuracy, compensateTemperature, compensateHumidity, raw_pressure, raw_temp, raw_humidity, raw_gas, co2, bVOC, bsec_status);

