mbuckaway/esp32-homekit-temp/main/app_main.c
    ESP_LOGI(TAG, "configuring ADC for battery level");
    // new implementation
    //-------------ADC1 Init---------------//

    adc_oneshot_unit_init_cfg_t init_config1 = {
        .unit_id = ADC_UNIT_1,
    };
    ESP_ERROR_CHECK(adc_oneshot_new_unit(&init_config1, &adc1_handle));

    //-------------ADC1 Config---------------//
    adc_oneshot_chan_cfg_t config = {
        .bitwidth = width,
        .atten = atten,
    };
    ESP_ERROR_CHECK(adc_oneshot_config_channel(adc1_handle, CONFIG_BATTERY_ADC_CHANNEL, &config));

    //-------------ADC1 Calibration Init---------------//
    do_calibration1 = example_adc_calibration_init(ADC_UNIT_1, atten, &adc1_cali_handle);
    ESP_LOGI(TAG, "Battery Level ADC running on GPIO %d", adc_gpio_num);

    /* Configure HomeKit core to make the Accessory name (and thus the WAC SSID) unique,
     * instead of the default configuration wherein only the WAC SSID is made unique.
     */
    ESP_LOGI(TAG, "configuring HAP");
    hap_cfg_t hap_cfg;
    hap_get_config(&hap_cfg);
    hap_cfg.unique_param = UNIQUE_NAME;
    hap_set_config(&hap_cfg);

    ESP_LOGI(TAG, "initializing HAP");
    /* Initialize the HAP core */
    hap_init(HAP_TRANSPORT_WIFI);

    /* Initialise the mandatory parameters for Accessory which will be added as
     * the mandatory services internally
     */
    hap_acc_cfg_t cfg = {
        .name = "Esp-Term",
        .manufacturer = "Espressif",
        .model = "EspTermp01",
        .serial_num = "001122334466",
        .fw_rev = "1.0.0",
        .hw_rev =  (char*)esp_get_idf_version(),
        .pv = "1.0.0",
        .identify_routine = temp_identify,
        .cid = HAP_CID_SENSOR,
    };
    ESP_LOGI(TAG, "Creating temperature accessory...");
    /* Create accessory object */
    tempaccessory = hap_acc_create(&cfg);

    /* Add a dummy Product Data */
    uint8_t product_data[] = {'E','S','P','3','2','H','A','P'};
    hap_acc_add_product_data(tempaccessory, product_data, sizeof(product_data));
    if (SENSOR_IN_USE == 1) {
        temperature = BME68xtemperature;
        humidity = BME68xhumidity;
    } else if (SENSOR_IN_USE == 2) {
        if (dht_read_float_data(sensor_type, CONFIG_GPIO_OUTPUT_IO_DHT22, &humidity, &temperature) == ESP_OK)
            ESP_LOGI(TAG, "Sensor Read: Temperature: %0.01f Humidity: %0.01f", temperature, humidity);
        else
            ESP_LOGE(TAG, "Could not read data from sensor on GPIO %d\n", CONFIG_GPIO_OUTPUT_IO_DHT22);
    }

    
    ESP_LOGI(TAG, "Creating temperature service (current temp: %0.01fC)", temperature);
    /* Create the temp Service. Include the "name" since this is a user visible service  */
    tempservice = hap_serv_temperature_sensor_create(temperature);
    hap_serv_add_char(tempservice, hap_char_name_create("ESP Temperature Sensor"));
    /* Set the read callback for the service (optional) */
    if (SENSOR_IN_USE == 1) {
        hap_serv_set_read_cb(tempservice, bm68xtempReturn);
    } else if (SENSOR_IN_USE == 2) {
        hap_serv_set_read_cb(tempservice, temp_read);
    }
    /* Add the temp Service to the Accessory Object */
    hap_acc_add_serv(tempaccessory, tempservice);


    ESP_LOGI(TAG, "Creating humidity service (current humidity: %0.01f%%)", humidity);
    /* Create the temp Service. Include the "name" since this is a user visible service  */
    humidityservice = hap_serv_humidity_sensor_create(humidity);
    hap_serv_add_char(humidityservice, hap_char_name_create("ESP Humidity Sensor"));
    /* Set the read callback for the service (optional) */
    if (SENSOR_IN_USE == 1) {
        hap_serv_set_read_cb(humidityservice, bm68xhumidReturn);
    } else if (SENSOR_IN_USE == 2) {
        hap_serv_set_read_cb(humidityservice, temp_read);
    }
    /* Add the humidity Service to the Accessory Object */
    hap_acc_add_serv(tempaccessory, humidityservice);

    // DHT line of sensors do not support AQI 
    if (SENSOR_IN_USE == 1) {
        ESP_LOGI(TAG, "Creating AQI service (current humidity: %d)", aqiReading);
        /* Create the aqi Service. Include the "name" since this is a user visible service  */
        aqiService = hap_serv_air_quality_sensor_create(aqiReading);
        VOCService = hap_char_voc_density_create(vocReading);
        co2Service = hap_char_carbon_dioxide_level_create(co2Reading);
        hap_serv_add_char(aqiService, hap_char_name_create("ESP AQI Sensor"));
        hap_serv_add_char(aqiService, co2Service);
        hap_serv_add_char(aqiService, VOCService);
        /* Set the read callback for the service (optional) */
        hap_serv_set_read_cb(aqiService, bm68xIAQReturn);
        /* Add the AQI Service to the Accessory Object */
        hap_acc_add_serv(tempaccessory, aqiService);
    }    

    
    u_int8_t battery_level = get_battery_level();
    ESP_LOGI(TAG, "Creating battery service (current battery level: %d)", battery_level);
    // Create the CloseIf switch
    battery_service = hap_serv_battery_service_create(battery_level, 0, (battery_level<25)?1:0);
    hap_serv_add_char(battery_service, hap_char_name_create("ESP Battery Level"));
    hap_serv_set_read_cb(battery_service, temp_read);
    hap_acc_add_serv(tempaccessory, battery_service);


#if 0
    /* Create the Firmware Upgrade HomeKit Custom Service.
     * Please refer the FW Upgrade documentation under components/homekit/extras/include/hap_fw_upgrade.h
     * and the top level README for more information.
     */
    hap_fw_upgrade_config_t ota_config = {
        .server_cert_pem = server_cert,
    };
    service = hap_serv_fw_upgrade_create(&ota_config);
    /* Add the service to the Accessory Object */
    hap_acc_add_serv(accessory, service);
#endif

    /* Add the Accessory to the HomeKit Database */
    ESP_LOGI(TAG, "Adding Temperature Accessory...");
    hap_add_accessory(tempaccessory);

    /* Register a common button for reset Wi-Fi network and reset to factory.
     */
    ESP_LOGI(TAG, "Register reset GPIO (reset button) on pin %d", RESET_GPIO);
    reset_key_init(RESET_GPIO);

